{"session_id":"01K25D9BP9FBJZZ6DQ8K9FG5T4","trigger":"meeting_end","title":"Chapter Walk-through 860 UN plaza","start_time":"2025-08-08T13:57:34-04:00","end_time":"2025-08-08T14:54:45-04:00","participants":[{"name":"Sami Majdalani","first_name":"Sami","last_name":"Majdalani","email":"sami@hellochapter.com"}],"owner":{"name":"Sami Majdalani","first_name":"Sami","last_name":"Majdalani","email":"sami@hellochapter.com"},"summary":"The discussion centered on the renovation plans for 860 UN Plaza, with a strong emphasis on kitchen, bathroom, and bedroom updates. Conference room participants explored various aspects of the kitchen layout, including the placement of appliances such as the sink, dishwasher, and fridge, while also considering the relocation of the washer-dryer. Enhancements like ceiling-high cabinets, indirect lighting, and a breakfast nook were proposed, while potential issues with existing structures that could affect the fridge's fit were also addressed. The importance of maintaining gas appliances on the same wall was highlighted, and it was agreed that collaboration with the in-house design team would be necessary for further planning.\n\nThe renovation budget was discussed, with clarification provided that finished materials like flooring and lighting fixtures would be selected in conjunction with designers and would not be included in the initial budget. Urgency was expressed in commencing the project post-approval to mitigate ongoing costs, while a timeline of three to four weeks for cabinet installation was estimated. The overall project budget was mentioned to be around $200,000, and it was agreed to prioritize renovations to streamline the process and avoid complications with co-op approvals.\n\nAdditionally, the design of closets and the potential installation of drop ceilings were addressed, weighing the benefits against costs. Effective lighting solutions were emphasized, particularly for the kitchen and office spaces, and concerns about maximizing space utilization were raised. The conversation concluded with a focus on ensuring that the renovations would create a functional and aesthetically pleasing environment, with plans to finalize a proposal for review later in the week.","action_items":[{"text":"The conference room participant will ensure that the design team will guide the conference room participant and the other conference room participant through the design process for the kitchen and bathrooms."},{"text":"The conference room participant will check the measurements for the knobs to ensure they fit the existing doors and new doors."},{"text":"The conference room participant will prepare a proposal detailing the renovation project and have it ready by early next week."},{"text":"A conference room participant will schedule a call to review the proposal with a conference room participant and another conference room participant."},{"text":"The conference room participant will include an itemized line for the drop ceiling in the proposal."}],"key_questions":[{"text":"How will the design team assist with material selection?"},{"text":"What is the timeline for starting the renovation project after approval?"},{"text":"Should the drop ceiling be included in the renovation?"}],"topics":[{"text":"Lighting and ceiling design"},{"text":"Kitchen design and layout considerations"},{"text":"Flooring options and costs"},{"text":"Material selection and sourcing process"}],"report_url":"https://app.read.ai/analytics/meetings/01K25D9BP9FBJZZ6DQ8K9FG5T4","chapter_summaries":[{"title":"Design and Renovation Discussion for 860 UN Plaza","description":"The renovation plans for 860 UN Plaza were reviewed, with an emphasis on the need to replace the flooring and consider options for automatic shades and lighting. Potential challenges posed by asbestos and the implications for costs and timelines were discussed. A conference room participant joined the conversation, contributing ideas for the kitchen layout and lighting.","topics":["Lighting and ceiling design","Kitchen design and layout considerations"]},{"title":"Kitchen Layout Discussion","description":"The question was raised about whether to keep the sink and dishwasher in their current locations. A proposal was made to move the washer-dryer to a different area, and the fridge's dimensions were discussed, noting potential fitting issues due to a wall. It was suggested that the kitchen layout be rearranged to accommodate the fridge better.","topics":[]},{"title":"Kitchen Renovation Discussion","description":"The kitchen renovation plans were outlined, focusing on new flooring, cabinets, and counters. The necessity of a door was debated, with suggestions for an opening to enhance visibility. The conversation also touched on the need for electrical outlets and the compatibility of new knobs with future door changes. The group agreed to proceed with base updates and consider additional changes as the project progresses.","topics":[]},{"title":"Design and Renovation Discussion for 860 UN Plaza","description":"The renovation plans for the bathrooms and bedrooms at 860 UN Plaza were reviewed by the conference room participants. The need for new vanities, the condition of the tiles, and the potential for adding electrical outlets were discussed. It was suggested by one participant to keep some elements as is, while another participant expressed interest in making updates to enhance the space.","topics":[]},{"title":"Proposal Review Scheduling","description":"A proposal is planned to be ready by early next week, and a call is proposed to discuss it. It is mentioned that Tuesday and Thursday are not suitable for a call, and Wednesday night is also inconvenient. The scheduling of the review is discussed for Thursday late afternoon or Friday, ultimately leaning towards Friday after 12 PM.","topics":["Flooring options and costs"]},{"title":"Discussion on Renovation Plans and Budget for 860 UN Plaza","description":"The conference room participant explained that certain materials, such as flooring and lighting fixtures, will not be included in the initial budget as they will be selected with designers. A preference for a swift start to the renovation after approval was indicated to avoid additional costs. The estimated costs for kitchen renovations were discussed, with a range of $50,000 to $90,000 provided depending on choices made.","topics":["Material selection and sourcing process"]},{"title":"Kitchen Design Discussion","description":"A suggestion was made to incorporate a pantry closet into the kitchen layout, while also highlighting the need to find a proper spot for the espresso machine. The conference room participants agreed on the idea of an oven range combo with an integrated microwave hood, which would enhance functionality. They also considered the possibility of creating a flush wall design to integrate the pantry and appliances seamlessly.","topics":[]},{"title":"Design and Renovation Discussion","description":"The renovation plans were detailed, including the removal of shelves from closets and preparation for custom shelving, which will require careful design and pricing. The implications of installing drop ceilings and the associated costs were explored, while also discussing the importance of maximizing storage and ensuring adequate lighting in the kitchen and office areas.","topics":[]}],"transcript":{"speaker_blocks":[{"start_time":1754675851142,"end_time":1754675851662,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Yeah, not bad."},{"start_time":1754675851883,"end_time":1754675852343,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"I know, right?"},{"start_time":1754675852363,"end_time":1754675856606,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"I thought it was going to be as hot as it actually is out there."},{"start_time":1754675857346,"end_time":1754675860349,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"I thought the weekend would be better, but I don't know."},{"start_time":1754675860429,"end_time":1754675861169,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"It's getting hot."},{"start_time":1754675861269,"end_time":1754675862490,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"It's getting better."},{"start_time":1754675862670,"end_time":1754675870696,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"So, Cole, have you seen the Evernote document that I sent to Massimo, like the all the information?"},{"start_time":1754675870936,"end_time":1754675891032,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yeah, I mean, we went through the scope briefly. And since we're going to be in this space now, you walked me through it, what you're looking to do. Yes, that's right. I think I I think he was saying... Yeah, probably a couple of years ago."},{"start_time":1754675891392,"end_time":1754675893613,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"How's it to work with the... It's good."},{"start_time":1754675893693,"end_time":1754675912191,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I mean, they have special rules that you need to... Oh, really? Once you're on good terms with the super... Yeah, yeah. All right. John, I think is who. Oh, really? Yeah, he's a very nice guy. John Popp? John Popp, yeah."},{"start_time":1754675912211,"end_time":1754675913432,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah, I saw an email from him."},{"start_time":1754675913712,"end_time":1754675916995,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yeah, he's the main guy. All right, all right, gotcha."},{"start_time":1754675939758,"end_time":1754675942358,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"How are you?"},{"start_time":1754675942378,"end_time":1754675949120,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Come on in."},{"start_time":1754675951920,"end_time":1754675955081,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Marianne, yes. How are you? Nice to meet you."},{"start_time":1754675955121,"end_time":1754675958382,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Nice to meet you. Thank you so much. Nice to meet you."},{"start_time":1754675958422,"end_time":1754675966033,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Hi again. Nice to meet you, Sal. Well, I was going to just run a quick errand and give you How much time do you need, so I'll come back?"},{"start_time":1754675966293,"end_time":1754675968115,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Probably more than that, actually."},{"start_time":1754675969636,"end_time":1754675973498,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Sure, I mean, you won't Maybe 30 minutes?"},{"start_time":1754675973598,"end_time":1754675977281,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"No, no, I'll give you 45. I'm just going to run you around."},{"start_time":1754675977401,"end_time":1754675981684,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"I can stay for a little bit. I just want to give you some space. Yeah, awesome. Thank you."},{"start_time":1754675981724,"end_time":1754675986627,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Thank you so much. I'll see you then. You're welcome."},{"start_time":1754675986647,"end_time":1754675987147,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Let's start."},{"start_time":1754675987187,"end_time":1754675990950,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Where do you want to start first?"},{"start_time":1754675992254,"end_time":1754676002442,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"We can start with this way and go in. This is very similar layout, yeah."},{"start_time":1754676002662,"end_time":1754676003783,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"So, floor."},{"start_time":1754676003963,"end_time":1754676016853,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"The big thing in this place is the floor. So, I mean, I know, I don't know what you guys do in the other place. I mean, the floor has to be replaced. It's not bad, but we want to replace it."},{"start_time":1754676017633,"end_time":1754676023605,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I mean, you have two options here. Either demo this Now, when you demo it, can you demo it?"},{"start_time":1754676024185,"end_time":1754676027326,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"floor and put new flooring or just go on Because we don't let you."},{"start_time":1754676028286,"end_time":1754676067908,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Did you demo the other one? We did not demo the other one. Yeah, we kept the existing flooring. So I mean, from what I see, you have space under the doors. So it's not an issue to go on top. How about the entrance? Is it an issue? No, you have plenty of space. On the contrary, you'll have a narrower gap, which is better. Between here and here? And look, look at all your doors here. So if for sure, you're going to replace the baseboards.\n\n"},{"start_time":1754676074670,"end_time":1754676087408,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"I mean, obviously it's going to be a lot more If we don't need to. I mean, I would love to get it all out, but yeah, it's way too expensive, I would think. And if we don't need to, or if it's probably just asbestos."},{"start_time":1754676088149,"end_time":1754676096035,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So if there's asbestos, it's another issue that you need to deal with, and it's going to be more time consuming and more costly to evade the asbestos."},{"start_time":1754676096075,"end_time":1754676101300,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Now, if there's asbestos in there, does it not seep out of there at all? How does it work? No, no."},{"start_time":1754676101440,"end_time":1754676112348,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"It's only if you disturb it, it can seep out. If you don't disturb it, all buildings in New York, even main risers, piping, insulation, all have asbestos. All right."},{"start_time":1754676118172,"end_time":1754676124336,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"If you Oh, yeah, because you know what? We've had, since we're on this already."},{"start_time":1754676125076,"end_time":1754676127498,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"We had done some visits to some places."},{"start_time":1754676128458,"end_time":1754676128859,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Oh, you have?"},{"start_time":1754676129927,"end_time":1754676161203,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"you're one step ahead yeah okay yeah I mean if you take that let's put it in the front door just to make sure we're just debating whether to go on top of the floor And even if you look around, you have space everywhere."},{"start_time":1754676164305,"end_time":1754676175090,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"It's cheaper, quicker, and you won't have to deal with And you're going to assume you're changing the baseboards, right?"},{"start_time":1754676187586,"end_time":1754676193311,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"What are you what do you want to do with this office? So here's the deal. So now this is all a combination of thoughts here."},{"start_time":1754676193371,"end_time":1754676195132,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Automatic shades."},{"start_time":1754676196494,"end_time":1754676198395,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Now I'm listening."},{"start_time":1754676198655,"end_time":1754676220424,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Automatic shades and we've had other quotes, we've talked to other contractors also and one idea was you know, put automatic shades, have a drop ceiling that comes down and covers everything. And so that we can actually put luscious lights and a chandelier in the center here."},{"start_time":1754676220744,"end_time":1754676224107,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Either probably here or she wants over there but I'm not sure."},{"start_time":1754676224768,"end_time":1754676225508,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"That's one thing."},{"start_time":1754676225528,"end_time":1754676232494,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"The other thing was a perimeter, kind of a perimeter crown molding type issue."},{"start_time":1754676232514,"end_time":1754676234956,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Like a reveal like for indirect lighting?"},{"start_time":1754676235777,"end_time":1754676274611,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Well maybe that could be part of it but one thing we have was the perimeter that would also conceal the shading hardware yes and also provide a little more depth in the room correct by not having to put a whole drop ceiling all the way across but the problem there is that if you want to put a junction box from this layer you need to drop the ceiling a bit yeah or you could run like a wire cover yes wire molding like which which doesn't look great but but also it depends Would you want to give up ceiling height or, or you would like to have a height?\n\n"},{"start_time":1754676276032,"end_time":1754676278112,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So between two, two and a half inches."},{"start_time":1754676279073,"end_time":1754676279413,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Uh, yeah."},{"start_time":1754676279473,"end_time":1754676287915,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"And if it's, if it's not that big of It's like, what's, you know, what's the cost difference."},{"start_time":1754676291296,"end_time":1754676295497,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So you want to put drop ceiling only in the living room or you're thinking about, yeah."},{"start_time":1754676295557,"end_time":1754676296917,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Well, yeah, I think so."},{"start_time":1754676296957,"end_time":1754676331373,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"We'll, we'll come to those. So what I'm going to do in my proposal, I'll have it as an itemized line item, and you'll be able to take a look and see how much would it impact the cost, and you can make a decision. I'm going to add it here. So if you have a drop ceiling, you'll gain the chandelier, and you'll gain indirect lighting. You'll lose some ceiling. Maybe with an inch here, but how much do you think up of the floors?\n\n"},{"start_time":1754676331673,"end_time":1754676335994,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Three quarters of an inch, then two or three inches. It's not a big deal."},{"start_time":1754676338534,"end_time":1754676350617,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So you're like, yeah, total Because these are 8'2\", here to there. So you'll be at like 7'9\". These things. I would, you would get rid of them."},{"start_time":1754676350657,"end_time":1754676473476,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah, you'll get rid of it. Well, I mean, if we do if you don't do drop ceiling you can salvage them and you know have the lighting above them yeah that does look nice though like there is lighting in there and it does look nice and now I'll actually when I go to the kitchen we'll talk about it also because there's an idea for that also but uh yeah I don't know if we don't do drop ceiling then we'll have to just break that and be public you can sand them and make them look better I know but yeah it's closer there to there Yeah, it's continuous but obviously not on the window side.\n\n Yeah, so that's kind of like what the deal is. If you're not willing to do the chandelier and lighting, you can just have a soffit around the shades to hide the shades, which would be right right well it'll be electronic yeah but that's I'm talking about high-range basically we'll definitely do kind of like what brian has yeah yeah he has a lot of traffic yeah yeah he has a lot of fun on that side and I'll go down okay so uh are you thinking to replace also all the doors well we need to do replaced um the door frames we're gonna leave and try to make it look better yeah I agree um this door also stay here um yeah maybe we'll go in and check the doors later but yeah but like you're keeping the door jams the frames sand them and repaint them yeah I mean they look they look all right yeah if they get refurbished it'll probably look pretty good okay um just you know so once you have the new floor It depends if you want to continue the floor in the kitchen or you're going to have tile here.\n\n We might do something different."},{"start_time":1754676473576,"end_time":1754676483301,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Yeah, we might do a tile wood look. I think tile is better than... We have samples. I think, so I do want to bring it up."},{"start_time":1754676484462,"end_time":1754676501961,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"And then you'll have here some kind of a transition or like stone saddle that will separate both areas. So these are... Oh, okay, nice. Yeah, we've used these before. That's nice. Yeah, and then you'll have like a transition piece here that separates the two areas. Maybe something like that."},{"start_time":1754676503022,"end_time":1754676505022,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"We saw these and we thought they were pretty cool."},{"start_time":1754676505122,"end_time":1754676514764,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yeah, they are cool. And they're good for kitchens because they're heavy duty. They won't scratch easily. Oh, that's the kitchen."},{"start_time":1754676514804,"end_time":1754676523406,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"So this has to be pretty much... That's the main part of the house. We have done everything. This is a pain point. Like, you know, this is where all the money's gonna go."},{"start_time":1754676523934,"end_time":1754676528358,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I mean, it's always like that. The kitchen is like the center of the..."},{"start_time":1754676528738,"end_time":1754676536085,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"They've never touched this kitchen. It's from the 1960s because our friends who live here had the kitchen already done. So this is..."},{"start_time":1754676536566,"end_time":1754676539548,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So you want your cabinets to go all the way to the ceiling, obviously."},{"start_time":1754676539588,"end_time":1754676540689,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So, yeah."},{"start_time":1754676540829,"end_time":1754676546394,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"So here's... This is what I was alluding to before with the lighting. So, first of all, this is not... I forgot, but some of these are empty."},{"start_time":1754676546535,"end_time":1754676550338,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"It might hold an exhaust duct here. Yeah, so they might be..."},{"start_time":1754676550418,"end_time":1754676554650,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"So I have Good luck."},{"start_time":1754676559673,"end_time":1754676560093,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Um, yeah."},{"start_time":1754676561334,"end_time":1754676576685,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Nice to I would definitely get rid of the soffit have cabinets to the ceiling cabinet to ceiling a little bit, a little bit, like maybe a few inches down."},{"start_time":1754676576705,"end_time":1754676583879,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"There's actually my friends downstairs have a place Indirect lighting above yeah, it's really cool."},{"start_time":1754676583899,"end_time":1754676590244,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yeah, we have this thing You don't need that at all But you you will you would cancel this well."},{"start_time":1754676590264,"end_time":1754676614302,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"I mean you always need extra lighting in the kitchen It looks nice downstairs because they have lighting here and they have indirect lighting Yeah, and it's like it looks clean Yeah, but I see you're saying that light you like and you can have like a flush surface mounted very thin fixture with a different switch and you can decide to turn it on or not but I wouldn't cancel this."},{"start_time":1754676614542,"end_time":1754676618926,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"And there will be something over there."},{"start_time":1754676618946,"end_time":1754676621088,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yeah exactly with a small seating maybe."},{"start_time":1754676621108,"end_time":1754676637311,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"We haven't decided what to do with the space over here I think we wanted to create a breakfast nook over here. I think that..."},{"start_time":1754676637431,"end_time":1754676639152,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"I should put wood there. I should put wood there."},{"start_time":1754676639593,"end_time":1754676647038,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So you were thinking something side to side here. We have a beautiful view."},{"start_time":1754676647058,"end_time":1754676650961,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"I know, in the morning. And you don't have to go to the main dining room and mess it up."},{"start_time":1754676651481,"end_time":1754676656525,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"If we don't do that, then we just put like a bistro table on there. That's the only other option."},{"start_time":1754676656925,"end_time":1754676664390,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Well, the other piece originally I wanted was like two couches, you know, the breakfast thing that they create and the table in the middle, but that takes too much space."},{"start_time":1754676664779,"end_time":1754676699082,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"At this stage, it's enough information. I don't know if Massimo mentioned, we have an in-house design team that, you know, if you decide to move forward with the project, they'll be guiding you through our design process and they'll do floor plans, renderings, 3D modelings for your kitchen, bathrooms, areas. So you have more visibility on the design and they'll guide you also for material selection, the tiles, flooring, cabinets, all that.\n\n So there's nothing no additional charges just our in-house design team. This is a requirement for the building."},{"start_time":1754676699122,"end_time":1754676714345,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Yeah, just don't want it here. So we have to figure out to relocate it. Yes, or I don't know if it is maybe in the corner over there where the table is."},{"start_time":1754676714485,"end_time":1754676726991,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So for the kitchen, are you are you are you fine with the general layout? Do you want to keep the sink in the sink? The new sink in the same location, the new dishwasher in the same location, or you're looking to change?"},{"start_time":1754676727471,"end_time":1754676740556,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"I think, well, so this is actually, the washer-dryer should go in that area over there, and we'll, and, because our friends downstairs have the sink set up, and they have their stuff in there. We'll make our way No, no, it's here."},{"start_time":1754676740576,"end_time":1754676742537,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"And I assume, huh?"},{"start_time":1754676743137,"end_time":1754676744418,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"But this is where the..."},{"start_time":1754676744838,"end_time":1754676746439,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Okay, yeah, yeah, the panel."},{"start_time":1754676750248,"end_time":1754676752049,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Yeah, this is over there."},{"start_time":1754676752069,"end_time":1754676756590,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"I think everything else how much stay where it is This piece."},{"start_time":1754676756930,"end_time":1754676759211,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"What was inches of the fridge?"},{"start_time":1754676759371,"end_time":1754676810671,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Oh fridge stuff. That's opening our It's a 36 inches across I believe and then the real inches the fridge we have our base 36 inches which won't fully fit in there So, I don't know what we should figure out because our friends are doing that if there's two right? Oh, they have a they have a scuff mark on the wall or to make in the fridge what's the what's the concern here your fridge might not fit well so the fridge that we're looking at it's gonna be like right here right there and if we open the fridge up it will hit the wall yeah which our friends do not surprise you have a beam here you have a wall so we have to think about that at some point you can't move anything here unless you move it this way you know well you can swap the cupboards but you can't really move it this way, because if you see here, you have a beam here.\n\n"},{"start_time":1754676811092,"end_time":1754676815175,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Well, you can swap it into a cupboard format, move the oven here and move the fridge over there."},{"start_time":1754676815295,"end_time":1754676817356,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"The fridge is not a big deal to relocate."},{"start_time":1754676818897,"end_time":1754676820398,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"But this has gas, isn't it?"},{"start_time":1754676820458,"end_time":1754676820979,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"This is, yes."},{"start_time":1754676821079,"end_time":1754676827083,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So because the pipes are there or something?"},{"start_time":1754676827604,"end_time":1754676828664,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"The risers are on this side."},{"start_time":1754676829385,"end_time":1754676843737,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So all the gas is here. I would keep your gas appliances on this wall rather than You can also... So that's a thought. Did you already purchase the fridge? No, we've seen all of that."},{"start_time":1754676844357,"end_time":1754676846498,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"We are in the last stage of approval process."},{"start_time":1754676846939,"end_time":1754676847939,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So when are you..."},{"start_time":1754676847979,"end_time":1754676850380,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"We're meeting the board on Friday or Wednesday."},{"start_time":1754676851101,"end_time":1754676855323,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"So we're having an interview on Wednesday. Got it. So that should kind of let us know what the deal is."},{"start_time":1754676855343,"end_time":1754676855663,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Got it."},{"start_time":1754676857724,"end_time":1754676897266,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"And what I wanted to ask for the kitchen. So new flooring, new cabinets, new counters. Top all good we're we're keeping the the door right do we need a you know what I don't think I don't think we should have a door that's right I didn't really know she was there I would put it I would just have an opening and you can make it even higher can you make it wider uh wider not really I mean if when you remove the door frame it'll be wider But that's your limit here.\n\n I think it's a good idea."},{"start_time":1754676901948,"end_time":1754676910791,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Depends if you like to, if Because if you walk in here, you have views or the entrance all the way to the inside."},{"start_time":1754676911611,"end_time":1754676912232,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"I think they do."},{"start_time":1754676912652,"end_time":1754676913212,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"They saw the door?"},{"start_time":1754676914072,"end_time":1754676916053,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Oh no, they do not because it's the door."},{"start_time":1754676916133,"end_time":1754676917374,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"It is kind of straight here."},{"start_time":1754676917394,"end_time":1754676925306,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"It is kind of narrow actually. Flooring baseboards updating switches and outlets I mean, yeah same location."},{"start_time":1754676925326,"end_time":1754676927587,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"It's not a big deal in the kitchen."},{"start_time":1754676927727,"end_time":1754676975896,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I want to ask you to wire If we do that we have to run wire up there, too Where like somewhere? I don't know like Like if you're doing a breakfast area here, but it's not a big deal. You have an outlet here. I'll see you up here Yeah, you can we can run we can run from this It's a thought pop in here. It's a thought exactly let's do the base And then once you start the project if you want to add an outlet outlet or do that.\n\n"},{"start_time":1754676978497,"end_time":1754676979158,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Any other color?"},{"start_time":1754676979518,"end_time":1754676984019,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Uh, here. Do you want to change all the knobs?"},{"start_time":1754676984119,"end_time":1754676992662,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Yeah, yeah, yeah. These things all should be chained, no?"},{"start_time":1754676992682,"end_time":1754676997284,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So the hinges, you have the options also to change it or keep them, whatever you want."},{"start_time":1754676998004,"end_time":1754677012524,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"How is the, um, if we do change the knob, And later on, we do want to change the doors. Now, will the knobs in the hardware be, do they fit like the new doors?"},{"start_time":1754677013304,"end_time":1754677042092,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So yeah, once the designers are selecting the knobs, they make sure they fit the existing doors. We take the measurements, make sure they fit the existing doors. And when you're purchasing new doors, we can make sure they fit the knobs you choose because we can pre-cut the holes the way we want. Switches and I'm assuming also you want to replace the light fixtures."},{"start_time":1754677042212,"end_time":1754677062725,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yes Okay flooring You want to go here this is uh, sorry the same pretty much The fact that um, I think this is we're just with these two things We might do something with this if we have..."},{"start_time":1754677062745,"end_time":1754677064886,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"It's not bad."},{"start_time":1754677064926,"end_time":1754677072830,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Like change the vanity? We might just... Do you want... At this stage, you want me to keep it out and if you decide to do it, it's not a big deal."},{"start_time":1754677073650,"end_time":1754677087457,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"That's basically what the deal is because the only thing in here is that if you notice, there's no outlets. There is no outlets. Good point. In all bathrooms. It's amazing. You have electrical. So what we don't obviously need outlets."},{"start_time":1754677087497,"end_time":1754677090608,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"But doing an outlet, you don't want to break the tile."},{"start_time":1754677090628,"end_time":1754677108740,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"People were saying, other contractors were saying, you know, we can just, you know, cut out some tiles, run through, or maybe run through behind here somehow. I don't know. Something, but like, I don't know, we need to. But like, this will probably have to go, this whole thing."},{"start_time":1754677109721,"end_time":1754677114764,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So you want to replace that? That's the guest bedroom?"},{"start_time":1754677114784,"end_time":1754677117346,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"This is number, this is the three bedrooms."},{"start_time":1754677117713,"end_time":1754677118313,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Third bedroom?"},{"start_time":1754677118573,"end_time":1754677120054,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I'm going to label it as third bedroom."},{"start_time":1754677120094,"end_time":1754677121515,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"That's what I have in my scheme actually."},{"start_time":1754677122835,"end_time":1754677125657,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Bedroom three. So do you want to replace the vanity and the..."},{"start_time":1754677125777,"end_time":1754677126317,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"I love it, yeah."},{"start_time":1754677126477,"end_time":1754677127217,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"You do?"},{"start_time":1754677127297,"end_time":1754677127637,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Right now?"},{"start_time":1754677129178,"end_time":1754677134540,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Vanity and medicine. What about the toilet, shower, you're fine with them?"},{"start_time":1754677136041,"end_time":1754677141784,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"I'll think about that. I don't know what the deal is with this. The floor."},{"start_time":1754677141804,"end_time":1754677144765,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Does it have to be scrubbed or what is that?"},{"start_time":1754677145253,"end_time":1754677155698,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I don't know. It has some, some, some cracks. It can be cleaned a bit, I don't know."},{"start_time":1754677156718,"end_time":1754677158459,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Do you create something on it or?"},{"start_time":1754677159720,"end_time":1754677161300,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"You can always tile over it, right?"},{"start_time":1754677162861,"end_time":1754677164022,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"You can always tile over it."},{"start_time":1754677165522,"end_time":1754677165983,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Anyways, okay."},{"start_time":1754677168204,"end_time":1754677169264,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"For now, I'll keep it out."},{"start_time":1754677172085,"end_time":1754677172886,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Or I'll reload, what do you think?"},{"start_time":1754677173887,"end_time":1754677175728,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"No, I would put it in there. We'll decide."},{"start_time":1754677175868,"end_time":1754677179250,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"I mean, if it's itemized, then we can just kind of like pick it."},{"start_time":1754677179310,"end_time":1754677179910,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yeah, sure."},{"start_time":1754677179970,"end_time":1754677182051,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Kind of do our own little editing."},{"start_time":1754677182131,"end_time":1754677187454,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"What happens with this thing? I know we don't want to take it out, but is there some place that there's new stuff that can put it in place?"},{"start_time":1754677189135,"end_time":1754677189635,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Which one?"},{"start_time":1754677189935,"end_time":1754677191256,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"This is hot and cold."},{"start_time":1754677191276,"end_time":1754677192416,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Those are heaters."},{"start_time":1754677204369,"end_time":1754677260464,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Pretty straightforward. Here, change the knobs, repaint, new floors, new baseboards, new outlets. This is the women's closet. Just refreshing this up. I mean when we're repainting we're gonna send everything That's what the second bathroom second second bathroom Okay, same thing. This is a better bathroom three. No wait So it's third bathroom second one. Oh, yeah one two and three over there So we're doing reverse three two and one three two.\n\n So here the same thing repeats casing, the medicine cabinet, vanity."},{"start_time":1754677260484,"end_time":1754677265766,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Do we do something to the tiles?"},{"start_time":1754677265946,"end_time":1754677294084,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So we had the same bathroom in 870 and Plaza. We did a deep clean and polish for the tiles. They came back really, like really nice, shiny because those are marbles. So they're very expensive. So also in 870, they decided to keep one of the bathrooms as is because they like the tiles. We like the tiles a lot. So you want me to put it in?"},{"start_time":1754677294104,"end_time":1754677296065,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"I'll balance it a little bit."},{"start_time":1754677296765,"end_time":1754677299486,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Actually, I don't know if this is part of the tile."},{"start_time":1754677299526,"end_time":1754677306869,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"It's very out of place though. It is if you look, but look also here, same thing."},{"start_time":1754677307189,"end_time":1754677309390,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"But it's like it dropped something on it."},{"start_time":1754677309410,"end_time":1754677321321,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"It's not part of the tile, it's like something has dropped. Maybe they tried also to fix it because it's cracked or something. Oh, this thing?"},{"start_time":1754677322222,"end_time":1754677323362,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Remove it?"},{"start_time":1754677323502,"end_time":1754677325604,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Repaint it?"},{"start_time":1754677342143,"end_time":1754677434165,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"What we can do is sand it and repaint it a bright color. That's the second bedroom. Repaint mid work. Yeah, it's useful and these things are expensive to rebuild. Let me ask you something. Got like some part of it and she I haven't been inspired yet but I just don't want to say the name like I mean it's a big piece of uh hardware you want to modify it a bit like say if you wanted to cut it yeah it's totally doable you know put a desk in there yeah what do you think about gutting part of this like this part and putting this face as a guest extra space gutting I don't know if you got you can take some drawers out and make it more what I'm seeing here is this is a nice desk space I can remove this have a center desk in the middle and remove these cut it up to here exactly you have a nice but the key is that this cannot be this color yeah i've already put in sanded and repainted like a bright color All the rooms are just like...\n\n"},{"start_time":1754677434205,"end_time":1754677435166,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Those are, yeah."},{"start_time":1754677435606,"end_time":1754677436106,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Two closets."},{"start_time":1754677441030,"end_time":1754677442591,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"It's a bathroom."},{"start_time":1754677443591,"end_time":1754677444332,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"It's the same deal."},{"start_time":1754677453987,"end_time":1754677474966,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Same deal as the two others, right? Those are closets. This is a big closet."},{"start_time":1754677475286,"end_time":1754677477068,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"So this one might be redesigned."},{"start_time":1754677483153,"end_time":1754677519829,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"For now, in the proposal, I'm going to put, demo everything, repaint it, prepare it, and then once you're designing it, we can code it on the site, because it's custom made. Okay, here, same thing, flooring, pretty straight forward. And one question, in the bathrooms, do you want to also repaint I'm gonna put a part of all switches and replace the new switches. I think everywhere in the whole place, which is...\n\n"},{"start_time":1754677520170,"end_time":1754677525915,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah, those all need replacements."},{"start_time":1754677525955,"end_time":1754677676238,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yeah, it's just in the same location. I'm gonna do a quick scan of the apartment. I'm going to start from here. It gives me all the dimensions quickly. No, it's fine. It won't capture you. No, no, it's fine. Yeah, it just captured Here is the space I don't know where it is."},{"start_time":1754677733762,"end_time":1754677776432,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"I've played lots of piece. You know, these little activities in between, like floors to the left. What is this for? And then, just create the side inside."},{"start_time":1754677778354,"end_time":1754677788218,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"For my friend, yeah, it's a little, my other friend, Maria, she has a tunnel bed that turns, and like all of the screens."},{"start_time":1754677788239,"end_time":1754677788879,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"From a wall?"},{"start_time":1754677789259,"end_time":1754677791339,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"Yeah, so it's like the bed is over there."},{"start_time":1754677791359,"end_time":1754677793041,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Yeah, yeah, yeah. You go over it."},{"start_time":1754677793061,"end_time":1754677801444,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"And then if you want the desk, you turn it, and on the other side is a screen. Over her, okay, over her."},{"start_time":1754677801853,"end_time":1754677809683,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"That's like a third person. Yeah, yeah. Have you met anyone where you put anything down?"},{"start_time":1754677809723,"end_time":1754677815330,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"No, no. Like once. Four dozen books. Yeah, yeah."},{"start_time":1754677860138,"end_time":1754677862221,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Do we need the door? Because every one of them."},{"start_time":1754677862761,"end_time":1754677864043,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"Yeah, probably this one."},{"start_time":1754677864343,"end_time":1754677954176,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Yeah, because they all, this one already has its privacy. So, yeah, you can take it off. It feels here a little narrower than upstairs, maybe because of this bulky, yeah. They're one of the best yeah yeah we work with these guys and they provide us with like trade discounts Yeah, exactly. Yeah, they're very good. All good, I got all the scans."},{"start_time":1754677979185,"end_time":1754678002414,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"What I'm going to do now is I'll work on a proposal. I'll have it ready by early next week. And I would love if we can get on a quick call to review it together. That way I'll have the opportunity to, you know, discuss every item and clarify any questions you might have. I don't know, how's your timing next week? Do you have any preference on day and time for a quick review, like 30, call? What, I think Wednesday night is good.\n\n"},{"start_time":1754678006453,"end_time":1754678024906,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"And Tuesday, she's going to work. Tuesday and Thursday, actually, into work. So those two days, probably nothing good. But other than that, Tuesday and Wednesday, you said? Tuesday and Thursday, she's actually in work. Wednesday night, it's bad. Remember, each week, this place. Got it."},{"start_time":1754678025006,"end_time":1754678032211,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I don't know if you want to do Thursday late afternoon, we can do that, or Friday, whatever works for you."},{"start_time":1754678032451,"end_time":1754678037562,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah, we could do, I know she's, What time on Friday?"},{"start_time":1754678038022,"end_time":1754678042404,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"You tell me, I'll let you know. Because Fridays are pretty free. That's the thing about that."},{"start_time":1754678042664,"end_time":1754678051108,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"You can do Friday morning if you want. Let's do Friday after 12. Because I know she kind of just happens and I can get away too."},{"start_time":1754678051448,"end_time":1754678059132,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So I shoot for Friday around this time too? So one week exactly from now."},{"start_time":1754678059152,"end_time":1754678060652,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"If we have time before then, I'll let you know."},{"start_time":1754678060672,"end_time":1754678061213,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah, definitely."},{"start_time":1754678064078,"end_time":1754678102138,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"And then I'm expecting to complete it by Tuesday. So anytime after Tuesday, you let me know. What I'm not going to include is obviously probably you know about that. We won't include any of the finished materials such as flooring itself, tiling you don't have, flooring of the kitchen, lighting fixtures, because those really vary in price and you'll be choosing them with the designers along the way.\n\n And we'll be sharing with you our trade discounts. So we have access to all our discounts with different vendors and we won't, we usually don't upcharge for these materials."},{"start_time":1754678102478,"end_time":1754678110943,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Because that's one thing I was actually curious about is like, you know, how do you guys source the stuff? And if, you know, if we find something, you know, at this day and age, Amazon."},{"start_time":1754678112864,"end_time":1754678182873,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"If you find something, you run it through our team, make sure we make sure it's good quality, we make sure We can install it and yeah, we can work together with that. That's why it's better not to include them in the beginning. But since you mentioned switches, for switches and outlets specifically, we usually put that included because they're all standard frameless, screwless outlets and covers. So you don't need to worry about that.\n\n The only thing you need to worry about is the floors, the light fixtures, plumbing fixtures like the vanity, the mirror, kitchen, I'm gonna price out the whole cabinets, countertops, everything for you. But yeah, for example, the appliances, the faucet itself, the sink itself, those things. Do you have like a specific, I know you're waiting But yeah, I will discuss more during the proposal review Now, on the interview, do you have a specific timeline?\n\n Are you waiting to start if you close?"},{"start_time":1754678182913,"end_time":1754678195821,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yes, I do. I think, I mean, we probably want to get this thing started fast. So, if we get approved, I assume we get approved, and we know Because we're ranting over there."},{"start_time":1754678196001,"end_time":1754678197742,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Okay, so you want to start as soon as possible."},{"start_time":1754678197762,"end_time":1754678203125,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"So we want to get this thing done and buttoned up as soon as possible. Because I don't want to be paying here and there, you know?"},{"start_time":1754678203145,"end_time":1754678223186,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Definitely, no, no. So that's the timeline. That's the biggest thing we have to do. But yeah, and since you're doing flooring, you're doing painting, you cannot be living here while you're doing the work. At least the first stage is like the flooring. So yeah, it's a good time to start sourcing a contractor now, because you want to start as soon as you close. And you know, like with all the..."},{"start_time":1754678223666,"end_time":1754678225767,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"What's the time for kitchens, I believe, guys?"},{"start_time":1754678226468,"end_time":1754678240659,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"We're quick, like by the time we're ready, put it this way, by the time we're ready to install the cabinets, we will have them ready to ship. Like three weeks, four weeks max. Oh really? It's not months. No, it's not months."},{"start_time":1754678240679,"end_time":1754678241839,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Give me an idea."},{"start_time":1754678241879,"end_time":1754678247201,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"What do you think about for a kitchen? Not average, but like decent kitchen we do."},{"start_time":1754678247281,"end_time":1754678258026,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"What are we looking at here? Including everything. Like cabinets, countertops, no appliances. No appliances. Flooring, everything, right?"},{"start_time":1754678258506,"end_time":1754678263117,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"How about just, how about sun's flooring? Let's do the So just everything except flooring."},{"start_time":1754678263637,"end_time":1754678287170,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Then tell me So just cabinets? So I mean, cabinets and countertop for this kitchen. So just cabinets and countertop, right? You're somewhere in the $40,000. And then you have another probably $10,000, $12,000, $10,000 for the floor. $15,000 for the flooring, painting, everything else. You can be in the $50,000 maybe, total. $50,000, yeah."},{"start_time":1754678287210,"end_time":1754678292031,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"How about actually, what about the flooring in this place? What do you think?"},{"start_time":1754678292771,"end_time":1754678310183,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Let me run the proposal. I just don't want to throw a number. No, no, no. I will detail it. I'll detail it as much as possible to a certain point where we can really choose what to do, what not to do. Obviously, you want to pay it and do the flooring."},{"start_time":1754678310203,"end_time":1754678326399,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Because those are the two biggest things. You came in at like $90,000. I'm like, OK, then. It's like Little too high for us, you know, but um for what I mean if you say like kitchen, yeah 90 000 You can't do that."},{"start_time":1754678326479,"end_time":1754678347793,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I know you can't because you know kitchen you can go you can even go Oh, yeah The sky is the limit of course, but like, you know, like yeah, so but I'm talking decent cabinets that we've used with our You know fabricators and our designers and everything. Yeah, you're looking at this. You can go a bit lower You can go a bit higher but like this is the range. Yeah, of course."},{"start_time":1754678348613,"end_time":1754678350514,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"All right."},{"start_time":1754678350534,"end_time":1754678356756,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"All right, so, uh, and then, I don't know, this will be probably, like, this whole transition has to be, like, kind of, like, nice and done."},{"start_time":1754678356796,"end_time":1754678361078,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yes, definitely. So do you want me to include the drop ceiling or no?"},{"start_time":1754678361458,"end_time":1754678364139,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Oh, yeah, yeah, just, I want to know how much that's going to cost."},{"start_time":1754678364439,"end_time":1754678365920,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"I'm going to put it as a line, right?"},{"start_time":1754678366000,"end_time":1754678366780,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Just in the living room."},{"start_time":1754678366800,"end_time":1754678375483,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Because I think that's, I think, by the day, by the end of the day, I think that'd be, like, the best thing to do with this place. Let's get it done, then we can put recessed lighting in."},{"start_time":1754678375552,"end_time":1754678390099,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"If you're doing a renovation, it's a co-op, and you know, to get approved, to start the work, it's a whole headache. So do as much as possible. Because if you're not going to do it now, you're never going to do it."},{"start_time":1754678390119,"end_time":1754678390500,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah, exactly."},{"start_time":1754678392601,"end_time":1754678413054,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"The question I know it's a big initial cost, but prioritize as much as possible. See what really you want to do, and try to do as much as possible. But yeah, everything's here. I mean, we're very familiar with the building and Hopefully you get approved, you know, good luck."},{"start_time":1754678413094,"end_time":1754678433590,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah I'm sure you will Did you have like if you had to throw a number a budget for all this I think we were throwing around up to 200."},{"start_time":1754678435189,"end_time":1754678436090,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"With the materials?"},{"start_time":1754678436910,"end_time":1754678440491,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Yeah, somewhere around there."},{"start_time":1754678440711,"end_time":1754678447574,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I mean the materials are not that much, you're not going crazy on marble."},{"start_time":1754678447594,"end_time":1754678456617,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"We had a place we were looking at and it was a full gut and it was like, it was a lot. This place is not as much?"},{"start_time":1754678457564,"end_time":1754678518282,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"thinking but it's a big place it's a big place but you want to refresh it you don't want to leave it like you want to repaint it or even are we're repainting the hvac covers right I think so because uh that's nothing too much sure we've repainted the ones in the other units yeah yeah these are all like no they're not a big deal you sand them and repaint them so there's one control here so you two have control yes yeah okay I thought there's I thought there's like more controls because I'm like yeah maybe we could do a couple more control situation we can just yeah yeah I kind of got a thermostat you know but that's kind of painful cool you have bright a bright apartment with very nice windows yeah exposure that's what kind of like what drew us to this place you live in the area we live yeah we live uh cun plaza yes the cun yeah the building to the right of that yeah that's where we live oh Yeah, yeah.\n\n I live here on 48th and 2nd."},{"start_time":1754678518302,"end_time":1754678523045,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I love You know that space, you could make it a pantry closet."},{"start_time":1754678523065,"end_time":1754678526427,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Yeah, I mean, we could do that. It's okay."},{"start_time":1754678526447,"end_time":1754678578297,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"We haven't figured out where the actual kitchen is going to go, you know. This makes sense as a pantry closet here because you already have the cutout for it. I'm going to consider this as a pantry. Because we're removing the soffit yeah yeah not without the countertop here just the whole floor to ceiling covered we're going to get back to the point on our lovely espresso machine I was just thinking about that your coffee machine where are you going to put your coffee machine that is very important very very important to us that was the place for it but now you need to find it no no it's going to be here somewhere Oh, you can put it there at the end where you have your breakfast area.\n\n"},{"start_time":1754678578317,"end_time":1754678586063,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Yeah, but I think we need a cover."},{"start_time":1754678586543,"end_time":1754678588624,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"That's too much to give up for an espresso machine."},{"start_time":1754678588644,"end_time":1754678594989,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"The other thing too is like, where do you put the microwave oven? If you don't leave that oven there, you put like a range oven combo."},{"start_time":1754678595009,"end_time":1754678600773,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Yeah, range oven combo, that's more popular. And then where do you put the microwave oven?"},{"start_time":1754678601033,"end_time":1754678609007,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Above the top like what you do now. Above the range. That'd be awesome because this way, that place right there above the range right now, you can't open it, right?"},{"start_time":1754678609067,"end_time":1754678616733,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"No, no, it's useless. It's useless. So what's popular now, do the oven range combo with the microwave integrated hood on there."},{"start_time":1754678616833,"end_time":1754678618554,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"That's what I would think, yeah."},{"start_time":1754678618574,"end_time":1754678621016,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"The move point, that's what we saw, right? It's a combo."},{"start_time":1754678621056,"end_time":1754678625399,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah, I guess so. If you have that space down there, put the counter all the way to the end."},{"start_time":1754678625781,"end_time":1754678690436,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"And then you'll free up the space. Yeah, the oven space. And you can have your pantry there or your coffee machine functionality you know you know what would be really nice I'm thinking about it now if you do that an opening remove the frame you have that wall have it all flush with the pantry all like one wall you have it all integrated because this will go all the way to the ceiling yeah this opening where you'll have the full it'll be nice yeah but the other piece is again I don't know if you can but um they have enough uh from a microwave oh you're saying put it up but it can also be in one of the closets sort of built in Her's is right here.\n\n"},{"start_time":1754678690575,"end_time":1754678692597,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"It's right here."},{"start_time":1754678692876,"end_time":1754678711843,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"Yeah, it's high up, but it's It comes down like this, right? And we wanted a bigger oven, so we did it underneath. Yeah, we're doing the range too. So that's why we put it in this space, but it's high up."},{"start_time":1754678712043,"end_time":1754678713604,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"But you have that wall there too?"},{"start_time":1754678715053,"end_time":1754678721978,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"I think we do. You do, because you have it. But this one, we use for the lot. Yeah, that's a problem."},{"start_time":1754678722018,"end_time":1754678725701,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"We have the bar, and we have a little door for like, right here."},{"start_time":1754678725721,"end_time":1754678729023,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"So yeah, I think we have this, yeah."},{"start_time":1754678729043,"end_time":1754678732986,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"I think it's just vertical. Everything behind it, plus the vertical will be down there."},{"start_time":1754678733126,"end_time":1754678735107,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"And then everything else is around it."},{"start_time":1754678735488,"end_time":1754678736128,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"More storage."},{"start_time":1754678736148,"end_time":1754678737729,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"I don't want a lot of stuff."},{"start_time":1754678737749,"end_time":1754678738910,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"I want to maximize storage."},{"start_time":1754678738950,"end_time":1754678740731,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"Plus you have that thing, the whole thing."},{"start_time":1754678740751,"end_time":1754678741192,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"I don't know."},{"start_time":1754678743622,"end_time":1754678800610,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"So we're going to gut out the closets, remove the shelves, prepare them, paint them, and then once we design, you know, the shelving and the mid work, we'll price it out separately because it's custom mid work. I don't want to just throw price yeah yeah because you need to draw it exactly that's a whole thing you're gonna be all involved in that yeah exactly because I need it's a whole two months for sure I think you'll be friends with our designers the other piece I want to think about is where do I put a safe also in a big in a big uh billboard thing on the wall just put them on one side yeah You're gonna have plenty of space.\n\n"},{"start_time":1754678800689,"end_time":1754678801389,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"What else?"},{"start_time":1754678802090,"end_time":1754678855555,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Okay, I'm That's it? What did you talk about this thing? She has something in her place. She's kind of making it nicer. It has to be there. I also thought like she also has wallpaper mm-hmm so to have a different patterns like a herringbone and then that won't affect my proposal now that's a design thing."},{"start_time":1754678855595,"end_time":1754678874305,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"But yeah, it's a good idea. No, the shades, we can recommend we work with a lot of shade vendors. I can send you some we have discounts with many of them. So I'll send you. I can hook you up directly with them."},{"start_time":1754678874325,"end_time":1754678883520,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Did you decide take that out?"},{"start_time":1754678883639,"end_time":1754678886582,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Well, we decided if we don't... So two options."},{"start_time":1754678886662,"end_time":1754678894227,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"If you do drop ceiling, we would take them out. If you don't do drop ceiling, you would keep them, repaint them, and keep indirect lighting on them, right?"},{"start_time":1754678896048,"end_time":1754678896947,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Oh, and in the kitchen."},{"start_time":1754678897688,"end_time":1754678903452,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"The indirect lighting. I have it. Yes, above the Under cabinet and above cabinet."},{"start_time":1754678909386,"end_time":1754678911827,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"That's a good design thing for the network, you know."},{"start_time":1754678911847,"end_time":1754678928232,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Actually, Sal, one more thought was, you know, your office? Yeah, that's what I'm talking about. Can you use half of Aiden's cupboard to do it? So you're out of my hair and with your child the whole time. It's the only thing that goes to bed."},{"start_time":1754678928272,"end_time":1754678932033,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Are you going to be working in that room a lot or not here a lot?"},{"start_time":1754678932193,"end_time":1754678934733,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"It's my house, I work in your house."},{"start_time":1754678935294,"end_time":1754678936294,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Three bedrooms. It's our house."},{"start_time":1754678938484,"end_time":1754678964393,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"perfect well thank you so much for your time I'll work on the proposal and then yeah we're gonna shoot for 2 p.m."},{"start_time":1754678964413,"end_time":1754679008823,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"to review it and if you have availability earlier you let me know yeah I can do it anytime starting Tuesday afternoon so you let me know I'm gonna put it into the full Friday I don't think it's dropped This looks like a drop though. No, no, it's not dropped. This is the same level. It's just an illusion."},{"start_time":1754679009063,"end_time":1754679016448,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"Yours is not dropped anywhere, right? It is. That's why we didn't do it. It was like that. That's why we could put like whatever."},{"start_time":1754679017188,"end_time":1754679018589,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"You guys got a nice kitchen."},{"start_time":1754679020844,"end_time":1754679029207,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"That's what I'm telling you wherever you have an existing box don't cancel it Just replace that. Yeah, I have a light."},{"start_time":1754679029247,"end_time":1754679034029,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"Yeah, so you don't really need to drop here, but maybe it's there, right?"},{"start_time":1754679034589,"end_time":1754679039490,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"But that's gonna be a lot of work. It'll make it look like a hotel."},{"start_time":1754679040351,"end_time":1754679041151,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"But this will be good."},{"start_time":1754679041171,"end_time":1754679053085,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Slowly and steadily we'll keep on I don't know how much work it is. So what, dropping the ceiling?"},{"start_time":1754679053105,"end_time":1754679054306,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"It messes up the house."},{"start_time":1754679054366,"end_time":1754679055907,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Yeah, that's going to be an issue."},{"start_time":1754679056067,"end_time":1754679057588,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"It is expensive, no?"},{"start_time":1754679058128,"end_time":1754679064133,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"I mean, it's going to be an additional cost. And it all depends if it's worth it or not."},{"start_time":1754679068896,"end_time":1754679073719,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"You don't have any switches so this is an option also be the easiest No, we do."},{"start_time":1754679074220,"end_time":1754679074480,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"You do?"},{"start_time":1754679074500,"end_time":1754679075160,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"Yeah, we do."},{"start_time":1754679075200,"end_time":1754679144610,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"But next to the switch. You talked about the bathroom. On top as well so we had yeah we had this we had this thing in the other apartment 870 but then they let us do it after a lot of back and forth we were able to break the tile but very slowly yeah because I think that the concrete comes with it now like it's it happened to a friend with the with the flooring styling on top will like narrow the space down especially if you have a bathtub well yeah if you It's a special building, but once you have good relations with them, they're fine.\n\n It's a beautiful building."},{"start_time":1754679145010,"end_time":1754679153075,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Before I forget, I want to know where the office is for Wednesday. On the left."},{"start_time":1754679153195,"end_time":1754679195411,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"I know where it is. I'll show you. Oh you're going down yeah here we go all right so we're good right we all go he gets his things on over here yeah I think she'll just come and lock it okay this is your stuff yeah okay I'm so excited neighbors oh my god where you live you live under yeah on the 28th I I thought 11th that way you can do a staircase I think it's more for the kids."},{"start_time":1754679196211,"end_time":1754679198992,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"No, but this But this is big."},{"start_time":1754679200393,"end_time":1754679203574,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"Here you go. It's opposite, isn't it?"},{"start_time":1754679203954,"end_time":1754679204914,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"No, this is the same size."},{"start_time":1754679205295,"end_time":1754679208436,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Oh, really? But your entry is like a line or two."},{"start_time":1754679208456,"end_time":1754679219240,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"Did you tell him about the outlet? You're going to need an outlet here for the... Depends on where you're going to put the router. Oh, you're going to put a light? Oh, yeah, you have to do that. For the router, yeah."},{"start_time":1754679220059,"end_time":1754679245440,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"like um oh you have to plug in the yeah you can get an altitude from here you have electrical and you it's not a big deal yeah that's what we have to do yeah because this thing uh my the wi-fi is very important in my work from home especially three days it seems like it's going to be an office not a house Are you sure?"},{"start_time":1754679245500,"end_time":1754679246881,"speaker":{"name":"UNKNOWN_SPEAKER"},"words":"I think we have enough."},{"start_time":1754679246921,"end_time":1754679248522,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"I'm 100% sure."},{"start_time":1754679248562,"end_time":1754679252945,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"Maybe yours is narrower and you Because we couldn't do a walk-in."},{"start_time":1754679253725,"end_time":1754679254466,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 1"},"words":"Oh, no."},{"start_time":1754679254806,"end_time":1754679261890,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"No, this is space. I don't know what to do with the space. That's what's bothering me."},{"start_time":1754679261970,"end_time":1754679264031,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"No, you can put a console there."},{"start_time":1754679264571,"end_time":1754679266612,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 3"},"words":"No, there's a hole and a chair."},{"start_time":1754679266953,"end_time":1754679268193,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 2"},"words":"Just like what they have."},{"start_time":1754679268213,"end_time":1754679274484,"speaker":{"name":"Conference Room (Sami Majdalani) - Speaker 4"},"words":"It's actually the best thing. I wanted to put the console there and Brian didn't let me. But if you can do it, I would do that."}],"speakers":[{"name":"Conference Room (Sami Majdalani) - Speaker 4"},{"name":"Conference Room (Sami Majdalani) - Speaker 3"},{"name":"Conference Room (Sami Majdalani) - Speaker 1"},{"name":"UNKNOWN_SPEAKER"},{"name":"Conference Room (Sami Majdalani) - Speaker 2"}]},"platform_meeting_id":"mobile-rwt53","platform":"mobile"}